export const qAndA = [
  {
    question: "كيف يتم تقييم تعلم الطلاب في المساق؟",
    answer: ["يتم تقييم مدى استيعاب الطالب لمعلومات المساق، عبر اختبار نهائي يتكون عادة من عشرة أسئلة، ويتطلب الحصول على ما يعادل 80٪ أو أكثر."],
  },
  {
    question: "ماهي سياسة الحضور والمشاركة؟",
    answer:
      "يعتبر وضع برنامج للحضور والمشاركة أمر يتعلق بإلتزامات كل طالب، حيث يمكنكم وضع جدول زمني لإتمام جميع دروس المساق.<br/> يعتبر مهم جداً إتمام جميع الدروس، والإطلاع على المراجع المقترحة من لدن الأساتذة، لأجل تحقيق الغاية من التكوين.",  },
];
